app/views/posts/_form.html.erb


   <%= f.collection_select :user_id, User.all, :id, :id %>
---
SELECT "users".* FROM "users"