app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "picture", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "test"], ["content", "test"], ["created_at", "2017-09-03 09:02:12.366868"], ["updated_at", "2017-09-03 09:02:12.366868"], ["picture", "スクリーンショット_2017-09-03_15.02.07.png"], ["user_id", 2]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = ?, "content" = ?, "picture" = ?, "picture2" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "test"], ["content", "test"], ["picture", "スクリーンショット_2017-08-06_14.07.58.png"], ["picture2", "スクリーンショット_2017-08-06_14.07.58.png"], ["updated_at", "2017-08-12 07:32:50.575497"], ["id", 9]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)