app/controllers/users_controller.rb

UPDATE "users" SET "name" = ?, "profile" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "arthur3"], ["profile", "arthur3"], ["updated_at", "2017-08-18 10:12:23.317901"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)